# Strings de prueba
hola_mundo=Hola mundo
# Strings de la explicacion
CAL_MCD_IND=Se calcular\u00e1 el m\u00e1ximo com\u00fan divisor de los siguientes n\u00fameros:
CAL_MCD_SX_EXP=El m\u00e1ximo com\u00fan divisor (MCD) es el n\u00famero m\u00e1s grande entre el cual son divisibles un conjunto de n\u00fameros.
CAL_MCD_SX_INT=Para calcularlo tendremos un valor de prueba que comenzar\u00e1 en 2, y dividiremos todos los n\u00fameros entre ese valor. Si la divisi\u00f3n de todos los n\u00fameros es exacta, el valor de prueba se convierte en un factor del MCD. Seguimos probando con el mismo valor, y cuando al menos una de las divisiones no sea exacta, el valor de prueba aumenta una unidad y se repite el procedimiento. El c\u00e1lculo termina cuando el valor de prueba se vuelve igual a alguno de los n\u00fameros. 
CAL_MCD_SX_RES=El MCD es igual al producto de los factores encontrados:
CAL_MCM_IND=Se calcular\u00e1 el m\u00ednimo com\u00fan m\u00faltiplo de los siguientes n\u00fameros:
CAL_MCM_NX_RES=El mcm es:
CAL_MCM_SX_EXP=El m\u00ednimo com\u00fan m\u00faltiplo (mcm) es el n\u00famero m\u00e1s peque\u00f1o que es divisible entre un conjunto de n\u00fameros.
CAL_MCM_SX_INT= Para calcularlo tendremos un valor de prueba que comenzar\u00e1 en 2, y dividiremos todos los n\u00fameros entre ese valor. Si la divisi\u00f3n de al menos un n\u00famero es exacta, el valor de prueba se convierte en un factor del mcm. Seguimos probando con el mismo valor, y cuando ninguna de las divisiones sea exacta, el valor de prueba aumenta una unidad y se repite el procedimiento. El c\u00e1lculo termina cuando todos los n\u00fameros se convierten en 1.
CAL_MCM_SX_RES=El mcm es igual al producto de los factores encontrados:
DIVS_NX=Se dividen las fracciones por pares:
DIVS_SX=Una divisi\u00f3n de m\u00e1s de dos fracciones se resuelve agrupando en pares las fracciones y resolviendo una por una todas las divisiones simples.
DIV_SIM_NX=Se resuelve con multiplicaciones cruzadas:
DIV_SIM_SX=Para resolver una divisi\u00f3n de dos fracciones se llevan a cabo dos multiplicaciones cruzadas. El numerador del resultado es igual al producto del numerador de la primera fracci\u00f3n por el denominador de la segunda, y el denominador del resultado es igual al producto del numerador de la segunda fracci\u00f3n por el denominador de la primera.
FR_CAI_DEN_EXA=Se establece 1 como el denominador de la fracci\u00f3n.
FR_CAI_IND=Se convertir\u00e1 a impropia la siguiente fracci\u00f3n:
FR_CAI_SX_DES=Una fracci\u00f3n que tiene expresadas una parte entera y una fraccionaria es una fracci\u00f3n mixta. Se puede agregar la parte entera a la fraccionaria para que as\u00ed quede representada solamente como una fracci\u00f3n impropia.
FR_CAI_SX_OPE=El numerador es igual al numerador original, sum\u00e1ndole el producto del entero por el denominador de la fracci\u00f3n. El entero se elimina y el denominador queda igual.
FR_CAM_IND=Se convertir\u00e1 a mixta la siguiente fracci\u00f3n:
FR_CAM_NOIMP=Esta fracci\u00f3n no es impropia, no se puede convertir.
FR_CAM_NOMIX=Esta fracci\u00f3n no es mixta, no se puede convertir.
FR_CAM_NOSIMP=Esta fracci\u00f3n no es impropia ni reducible, no se puede simplificar.
FR_CAM_SX_CIII_ENT=Ahora es donde retomamos la parte entera que hab\u00edamos ignorado, donde tan s\u00f3lo debemos sumarla al entero de la fracci\u00f3n que acabamos de determinar:
FR_CAM_SX_CIII_MIX=Pero como la fracci\u00f3n ya est\u00e1 representada en forma de n\u00famero mixto, solo tomaremos en cuenta la parte fraccionaria por ahora.
FR_CAM_SX_CII_EXA=Pero tenemos que esta divisi\u00f3n es exacta, por lo que el resultado queda representado solamente con el entero, y se puede comprobar haciendo la siguiente operaci\u00f3n:
FR_CAM_SX_DES=Una fracci\u00f3n cuyo numerador es m\u00e1s grande que el denominador es impropia. Esto quiere decir que contiene una parte entera, por lo que se le puede extraer y as\u00ed obtener una fracci\u00f3n mixta.
FR_CAM_SX_DET_DEN=Por \u00faltimo, el denominador de la fracci\u00f3n no cambia y las operaciones realizadas pueden representarse de la siguiente manera:
FR_CAM_SX_DET_ENT=El entero de la fracci\u00f3n resulta de dividir el numerador entre el denominador, sin tomar en cuenta los decimales.
FR_CAM_SX_DET_NUM=El numerador de la fracci\u00f3n resulta de multiplicar el valor anteriormente calculado por el denominador de la fracci\u00f3n y restarlo del numerador original.
FR_RESULTADO=Lo que nos da como resultado:
FR_SIM_IND=Se simplificar\u00e1 la siguiente fracci\u00f3n:
FR_SIM_MCD=Encontramos el MCD entre el numerador y el denominador:
FR_SIM_SX_CAM=Comparando el numerador con el denominador tenemos que el primero es mayor, por lo tanto la fracci\u00f3n es impropia, as\u00ed que se debe convertir a mixta.
FR_SIM_SX_DIV=Por \u00faltimo se dividen el numerador y el denominador entre el MCD que acabamos de calcular:
FR_SIM_SX_INT=Simplificar una fracci\u00f3n significa, reducirla a una equivalente pero m\u00e1s simple.
FR_SIM_SX_UNI_MIX=Como el numerador y el denominador son iguales, la parte fraccionaria tiene un valor de 1, as\u00ed que s\u00f3lo se lo sumamos al valor de la parte entera.
FR_SIM_SX_UNI_NOMIX=Una fracci\u00f3n en la que el numerador y el denominador son iguales, se llama fracci\u00f3n unidad, por lo que su valor es 1.
FUN_CAI_FRACS_RES=Las fracciones quedan as\u00ed:
FUN_DET_EQU=Se determinar\u00e1 si las siguientes fracciones son equivalentes:
FUN_DET_MAY=Se determinar\u00e1 cu\u00e1l de las siguientes fracciones es la mayor:
FUN_DET_REC=Se determinar\u00e1 si las siguientes fracciones son rec\u00edprocas:
FUN_INST_EQU=Dos fracciones son equivalentes si los productos del numerador de una por el denominador de la otra son iguales.
FUN_INST_MAY=Para saber cu\u00e1l de las fracciones es mayor se multiplica el numerador de una por el denominador de la otra, la fracci\u00f3n mayor es la que cuyo numerador corresponde al producto mayor de los anteriormente calculados.
FUN_INST_REC=Dos fracciones son rec\u00edprocas si el producto de sus numeradores es igual al producto de sus denominadores.
FUN_PLT=Por lo tanto:
FUN_RES_IGU=Las fracciones son iguales
FUN_RES_MAY=La mayor es:
FUN_RES_NO_EQU=No son equivalentes
FUN_RES_NO_REC=No son rec\u00edprocas
FUN_RES_SI_EQU=S\u00ed son equivalentes
FUN_RES_SI_REC=S\u00ed son rec\u00edprocas
MIX_NX_GRUP=Se agrupan las multiplicaciones y divisiones y se resuelven:
MIX_NX_SUMRES=Se resuelven las sumas y restas:
MIX_SX_GRUP=Cuando tenemos una operaci\u00f3n en la que se combinan sumas o restas con multiplicaciones o divisiones, cambia el orden de resoluci\u00f3n de la operaci\u00f3n. Primero se resuelven las multiplicaciones y divisiones, y por \u00faltimo, las sumas y restas. Lo que haremos es agrupar las operaciones de la siguiente manera:
MIX_SX_PAREN=Resolvemos primero las operaciones que est\u00e1n dentro de los par\u00e9ntesis:
MIX_SX_SUMRES=Por \u00faltimo resolvemos las sumas y restas resultantes:
MUL_DIV_NX_GRUP=Se agrupa la primera fracci\u00f3n con las multiplicaciones y se resuelve, despu\u00e9s se resuelven las divisiones.
MUL_DIV_SX_GRUP=Para resolver una operaci\u00f3n donde tenemos multiplicaciones y divisiones juntas, agruparemos la primera fracci\u00f3n con todas las que est\u00e1n multiplicando. Despu\u00e9s, al resultado se le ir\u00e1n dividiendo una por una las fracciones restantes.
MUL_NX=Se multiplican los numeradores entre s\u00ed, al igual que los denominadores:
MUL_SX=El numerador del resultado de una multiplicaci\u00f3n de fracciones es igual al producto de los numeradores, y a su vez, el denominador es igual al producto de los denominadores:
OPE_EMP_ESM=Esta fracci\u00f3n es mixta:
OPE_INI=Se resolver\u00e1 la siguiente operaci\u00f3n:
OPE_NX_CAI=Se convierten las fracciones mixtas a impropias:
OPE_NX_RES_SIM=La fracci\u00f3n simplificada es:
OPE_RES=El resultado de la operaci\u00f3n es:
OPE_RES_CONV=La operaci\u00f3n queda as\u00ed:
OPE_SX_CAI=Para poder llevar a cabo la operaci\u00f3n, primero debemos convertir todas las fracciones mixtas a impropias:
OPE_SX_EMP_CAI=Para comenzar con la operaci\u00f3n, primero se representar\u00e1n todas las fracciones de la misma forma, convirtiendo las que sean mixtas en impropias.
SUM_NX_DEN_DIF=Convertimos las fracciones a equivalentes y que tengan el mismo denominador:
SUM_NX_DEN_IGU=Realizamos las operaciones sobre los numeradores:
SUM_SX_CONV_MCM=El numerador de cada nueva fracci\u00f3n es igual a dividir el mcm calculado entre el denominador de la fracci\u00f3n y multiplicada por su numerador. El denominador de la nueva fracci\u00f3n ser\u00e1 el mcm.
SUM_SX_DEN=En una suma o resta de fracciones, primero debemos analizar los denominadores.
SUM_SX_DEN_DIF=Como son diferentes, debemos expresar las fracciones de tal forma que tengan el mismo denominador. Para esto calcularemos el m\u00ednimo com\u00fan m\u00faltiplo.
SUM_SX_DEN_IGU=Como son iguales, la operaci\u00f3n se resuelve directamente, sumando o restando los numeradores seg\u00fan corresponda y el denominador queda igual.
SUM_SX_OPE_NUMS=Por \u00faltimo se realizan las operaciones sobre los numeradores:
# Strings de la GUI
LABEL_ACEPTAR=Aceptar
LABEL_ACERCA_DE=Acerca de...
LABEL_AGREGAR_FRACCION=Agregar fracci\u00f3n
LABEL_AMARILLO=Amarillo
LABEL_ARCHIVO=Archivo
LABEL_ARCHIVO_PDF=Archivos pdf (*.pdf)
LABEL_AVISO=AVISO
LABEL_AVISO_EXPLICACION=Los cambios en el nivel de detalle de la explicaci\u00f3n se ver\u00e1n hasta la pr\u00f3xima vez que se resuelve una operaci\u00f3n.
LABEL_AYUDA=Ayuda
LABEL_AZUL=Azul
LABEL_CAI=C.A.I.
LABEL_CAM=C.A.M.
LABEL_CANCELAR=Cancelar
LABEL_COMAS=Inserta los n\u00fameros separados por comas
LABEL_CONFIRMACION=CONFIRMACI\u00d3N
LABEL_CONFIRMACION_IDIOMA=Para ver los cambios debes reiniciar Fraccionando, lo cual borrar\u00e1 los datos de tu \u00e1rea de trabajo, \u00bfDeseas continuar?
LABEL_CONTACTO=Contacto: porfirioads@gmail.com
LABEL_DENOMINADOR=Denominador
LABEL_DESARROLLADO=Desarrollado por: Porfirio \u00c1ngel D\u00edaz S\u00e1nchez
LABEL_DETALLADA=Detallada
LABEL_ENCABEZADO_PDF=Pasos de la soluci\u00f3n
LABEL_ENTERO=Entero
LABEL_ENTRADA=Entrada
LABEL_EQUIVALENTES=Equivalentes
LABEL_ERROR=ERROR
LABEL_ERROR_GUARDAR=Resuelve una operaci\u00f3n antes de guardarla
LABEL_ESPANOL=Espa\u00f1ol
LABEL_EXPLICACION=Explicaci\u00f3n
LABEL_FRACCION=Fracci\u00f3n
LABEL_GUARDAR=Guardar
LABEL_IDIOMA=Idioma
LABEL_INGLES=Ingl\u00e9s
LABEL_MAYOR=Mayor
LABEL_MCD=M.C.D.
LABEL_MCM=M.C.M.
LABEL_MORADO=Morado
LABEL_NUEVO=Nuevo
LABEL_NUMERADOR=Numerador
LABEL_OPERACIONES=Operaciones
LABEL_PREFERENCIAS=Preferencias
LABEL_RECIPROCAS=Rec\u00edprocas
LABEL_REINICIAR=Reiniciar
LABEL_REMOVER=Remover
LABEL_RESOLVER=Resolver
LABEL_RESULTADO=Resultado
LABEL_ROJO=Rojo
LABEL_ROSA=Rosa
LABEL_SALIR=Salir
LABEL_SIMPLE=Simple
LABEL_SIMPLIFICAR=Simplificar
LABEL_TEMA=Tema
LABEL_TITULO_ACERCA_DE=Acerca de Fraccionando
LABEL_TITULO_CAI=Convertir a impropia
LABEL_TITULO_CAM=Convertor a mixta
LABEL_TITULO_EQUIVALENTES=Comprobar equivalentes
LABEL_TITULO_MAYOR=Determinar mayor
LABEL_TITULO_MCD=M\u00e1ximo Com\u00fan Divisor
LABEL_TITULO_MCM=M\u00ednimo Com\u00fan M\u00faltiplo
LABEL_TITULO_RECIPROCAS=Comprobar rec\u00edprocas
LABEL_TITULO_SIMPLIFICAR=Simplificar fracci\u00f3n
LABEL_TOOL_AC_DEN=Reinicia el denominador
LABEL_TOOL_AC_ENT=Reinicia la parte entera
LABEL_TOOL_AC_NUM=Reinicia el numerador
LABEL_TOOL_AGREGAR_FRACCION=Agrega la otra fracci\u00f3n de la comparaci\u00f3n
LABEL_TOOL_CAI=Convierte una fracci\u00f3n mixta en impropia
LABEL_TOOL_CAM=Convierte una fracci\u00f3n impropia en mixta
LABEL_TOOL_DEL_DEN=Borra el \u00faltimo d\u00edgito del denominador
LABEL_TOOL_DEL_ENT=Borra el \u00faltimo d\u00edgito de la parte entera
LABEL_TOOL_DEL_NUM=Borra el \u00faltimo d\u00edgito del numerador
LABEL_TOOL_DIVISION=Agrega una divisi\u00f3n
LABEL_TOOL_ENTRADA_COMPARACION=En esta \u00e1rea se muestran las fracciones de la comparaci\u00f3n que se est\u00e1n ingresando
LABEL_TOOL_ENTRADA_CONVERSION=En esta \u00e1rea se muestra la fracci\u00f3n que se est\u00e1 ingresando
LABEL_TOOL_ENTRADA_OPERACION=En esta \u00e1rea se muestra la operaci\u00f3n que se est\u00e1 ingresando
LABEL_TOOL_EQUIVALENTES=Determina si dos fracciones son equivalentes
LABEL_TOOL_EXPLICACION=En esta \u00e1rea se muestran los pasos de la explicaci\u00f3n
LABEL_TOOL_MAYOR=Determina la mayor de dos fracciones
LABEL_TOOL_MCD=Calcula el M\u00e1ximo Com\u00fan Divisor entre varios n\u00fameros
LABEL_TOOL_MCM=Calcula el M\u00ednimo Com\u00fan M\u00faltiplo entre varios n\u00fameros
LABEL_TOOL_MULTIPLICACION=Agrega una multiplicaci\u00f3n
LABEL_TOOL_RECIPROCAS=Determina si dos fracciones son rec\u00edprocas
LABEL_TOOL_REINICIAR_FRACCION=Reinicia la fracci\u00f3n que se est\u00e1 ingresando actualmente
LABEL_TOOL_REINICIAR_OPERACION=Reinicia la operaci\u00f3n ingresada
LABEL_TOOL_REMOVER=Elimina la \u00faltima fraccion ingresada
LABEL_TOOL_RESOLVER=Resuelve la operaci\u00f3n ingresada
LABEL_TOOL_RESTA=Agrega una resta
LABEL_TOOL_RESULTADO=En esta \u00e1rea se muestra el resultado de la operaci\u00f3n
LABEL_TOOL_SIMPLIFICAR=Simplifica una fracci\u00f3n
LABEL_TOOL_SUMA=Agrega una suma
LABEL_VERSION=Fracionando 1.1
